package com.tyl.pachong.config;

import java.util.HashMap;
import java.util.Map;

public final class NameAndId {
    private static Map<String, String> NI;

    public static Map<String, String> getNI() {
        return NI;
    }

    public static void setNI(Map<String, String> NI) {
        NameAndId.NI = NI;
    }
    //TODO 塞url和DB的id进去，给别人一次拿完然后读取数据


    public NameAndId() {
        NI = new HashMap<>();
        //标题
        NI.put("基础标题", "1301335451511443458");
        NI.put("框线标题", "1301335451675021314");
        NI.put("图片标题", "1301335451888930818");
        NI.put("底色标题", "1301335452169949185");
        NI.put("符号标题", "1301335452379664386");
        NI.put("主副标题", "1301335452589379585");
        NI.put("编号标题", "1301335452799094786");
        NI.put("竖排标题", "1301335452899758082");
        //NI.put("全部标题","1301335451029098497");

        //卡片
        NI.put("基础卡片", "1301335453289828354");
        NI.put("框线卡片", "1301335453398880258");
        NI.put("底色卡片", "1301335453495349250");
        NI.put("底纹卡片", "1301335453600206850");
        NI.put("图文卡片", "1301335453780561922");
        NI.put("对话/问答", "1301335453990277122");
        NI.put("轴线卡片", "1301335453885419522");
        //NI.put("全部卡片","1301335453075918849");

        //图片
        //NI.put("图片","1301335454086746113");
        NI.put("基础图片", "1301335454195798017");
        NI.put("单图", "1301335454300655618");
        NI.put("双图", "1301335454506176514");
        NI.put("三图", "1301335454615228418");
        NI.put("多图", "1301335454720086018");
        NI.put("圆形图", "1301335454824943617");
        NI.put("背景图", "1301335455001104385");

        //布局
        //NI.put("布局","1301335455105961986");
        NI.put("基础布局", "1301335455215013890");
        NI.put("组合", "1301335455311482881");
        NI.put("表格", "1301335455420534786");
        NI.put("滑动", "1301335455521198082");
        NI.put("SVG互动", "1301335455630249985");

        //引导
        //NI.put("引导","1301335455730913282");
        NI.put("关注和原文", "1301335455839965186");
        NI.put("二维码名片", "1301335455936434177");

        //组件
        //NI.put("组件","1301335456045486081");
        NI.put("分割线", "1301335456150343681");
        NI.put("贴纸", "1301335456326504449");
        NI.put("SVG贴纸", "1301335456850792450");
        NI.put("零件", "1301335456431362049");
        NI.put("视频", "1301335456536219650");
        NI.put("小程序", "1301335456745934849");
        NI.put("表单组件", "1301335456641077250");


//        //热门
//        NI.put("热门","3233");
//        NI.put("校园","771");
//        NI.put("简约","671");
//        NI.put("秋天","1126");
//        NI.put("教师节","555");
//        NI.put("商务","2011");
//        NI.put("党政","196");
    }

    public static void main(String[] args) {
        new NameAndId().getNI().forEach((k, v) -> System.out.println(k + "::" + v));
    }
}
